# CIA Factbook

For this project, SQL module was installed to enable query execution using the following command: `!pip install ipython-sql`.

# Connecting to the Database

Below are the steps to establish a connection to the database.

1. Import the `sqlalchemy` library to create an engine and connect to `factbook.db`
2. Load the previously installed `SQL` module
3. Connect to the database with a connection string

In [6]:
# Step 1
import sqlalchemy

sqlalchemy.create_engine('sqlite:///factbook.db')

Engine(sqlite:///factbook.db)

In [7]:
# Step 2
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [3]:
# Step 3
%sql sqlite:///factbook.db

Database connection should be established successfully.

# Overview of the Data

To mark an entire cell as an SQL block, a prefix `%%sql` is required at the start.

## Information on the Tables in Database

The query below returns the table `facts`.

In [5]:
%%sql

SELECT *
FROM sqlite_master
WHERE type='table';

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

The next query returns the first five rows of data in the `facts` table.

In [4]:
%%sql

SELECT * FROM facts LIMIT 5;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

The following table briefly describes some of the columns.

| Column            | Description                                                                 |
| :---:             | :---:                                                                       |
| name              | The name of the country                                                     |
| area              | The country's total area (both land and water)                              |
| area_land         | The country's land area in square kilometers                                |
| area_water        | The country's waterarea in square kilometers                                |
| population        | The country's population                                                    |
| population_growth | The country's population growth as a percentage                             |
| birth_rate        | The country's birth rate, or the number of births per year per 1,000 people |
| death_rate        | The country's death rate, or the number of death per year per 1,000 people  |

To begin, some summary statistics are calculated to see some data.

# Summary Statistics

The query below finds the maximum (`MAX()`) and minimum (`MIN()`) `population` and `population_growth` rate respectively.

In [9]:
%%sql

SELECT
MIN(population) AS min_population,
MAX(population) AS max_population,
MIN(population_growth) AS min_population_growth,
MAX(population_growth) AS max_population_growth
FROM facts;

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

Based on the results, there is a country with population 0 and on the other end, a country with population of more than 7.2 billion people (world population is 7.9 billion according to [worldometers](https://www.worldometers.info/world-population/)).

Subqueries are used to zoom in on these countries without using specific values.

In [11]:
%%sql

SELECT *
FROM facts
WHERE population == (SELECT MIN(population)
       FROM facts);

 * sqlite:///factbook.db
Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]